UpdatedAbillt/app/controllers/apps_controller.rb

	def index
		#if params[:category].blank?
		#@appss=App.all.order("created_at DESC")
		@apps = App.all
---
SELECT "apps".* FROM "apps"

	def show
		@apps = App.find(params[:id])
---
SELECT  "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", 1]]

	def new
		@apps = App.new
		@categories = Category.order(:name)
---
SELECT "categories".* FROM "categories"  ORDER BY "categories"."name" ASC

	def create
		@apps = App.new(app_params)

		respond_to do |format|
			if @apps.save
---
INSERT INTO "apps" ("name", "rating", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "price", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)