UpdatedAbillt/app/controllers/store_controller.rb

  def index
  	@products = App.order(:name)
---
SELECT "apps".* FROM "apps"  ORDER BY "apps"."name" ASC