UpdatedAbillt/app/views/apps/show.html.erb

		<div class="average-review-rating" data-score=<%= @average_review %>></div>
		<span class="number-of-reviews">Based on <%= @apps.reviews.count %> reviews</span>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."app_id" = ?  [["app_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."app_id" = ?  [["app_id", 1]]